// MyLabTask.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
float b;
float q;
float sum;


int main()
{
    cout << "Enter your first member of the progression: " << endl;
    cin >> b;
    cout << "Enter your denominator of geometric progression (less than 1):  " <<  endl;
    cin >> q;
    if(!((q > 0) and (q < 1)))
    {
        cout << "denominator of geometric progression must be less then 1,try again... " << endl;
        cin >> q;
    }
    sum =  b / (1 - q);
    cout << "Result is=  " << sum << endl;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
